Repository: openandroidinstaller-dev/openandroidinstaller
Catalog: locales/*/LC_MESSAGES/*.po
Languages: fr

source: To do this, - **tap seven times on the build number** in the 'System'- or 'About the phone'-Menu in Settings. You can also use the phones own search to look for `build number`. - Then go back to the main menu and look for **'developer options'**. You can also search for it in your phone. - When you are in developer options, **toggle OEM unlocking and USB-Debugging**. - If your phone is already connected to your PC, a pop-up might appear. **Allow USB debugging in the pop-up on your phone.** Now you are ready to continue.
fr: Pour faire cela, - **tappez sept fois sur le numéro de build** dans le menu 'Système' ou 'À propos' dans les paramètres. Vous pouvez également chercher 'numéro de build' dans les paramètres. - Ensuite, retournez sur le menu précédent et cherchez **options développeurs**. Vous pouvez également utiliser la fonctionnalité recherche. - Lorsque vous êtes dans les options développeurs, sélectionnez **déverouillage OEM** et **Débogage USB**. - Si l'appareil est déjà branché au PC, une fenêtre peut apparaitre. **Autorisez le débogage USB.** Vous pouvez maintenant continuer.

source: Bootloader is already unlocked.
fr: Le bootloader est déjà dévérouillé.

source: Custom recovery is already flashed.
fr: Un recovery alternatif est déjà flashé.

source: Detected device:
fr: Appareil détecté :

source: Get the phone ready
fr: Préparer l'appareil

source: To get started you need to - **enable developer options** on your device - and then **enable USB debugging** and **OEM unlocking** in the developer options.
fr: Pour commencer vous devez : - **activer les options développeur** sur votre appareil - puis activer le **débogage USB** et le **déverouillage OEM** dans les options développeur.

source: How do I enable developer options?
fr: Comment activer les options développeur ?

source: Get help to enable developer options and OEM unlocking.
fr: Obtenir de l'aide pour activer les options développeur et le débogage USB.

source: Now - **connect your device to this computer via USB** and - **allow USB debugging in the pop-up on your phone**. - You might also need to **activate "data transfer"** in the connection settings. - Then **press the button 'Search device'**. When everything works correctly you should see your device name here and you can continue.
fr: Maintenant : - **connectez votre appareil à ce PC via USB** et - **activez le débogage USB sur votre appareil** (une fenêtre doit apparaitre). - Vous pouvez également avoir besoin d'**activer le transfert de données** dans les paramètres de connection USB. - Ensuite, **cliquez sur le bouton 'Chercher l'appareil'**. Lorsque tout fonctionne correctement, vous devez voir le nom de votre appareil, puis vous pouvez continuer.

source: If you **already unlocked the bootloader** of your device or already **flashed a custom recovery**, please toggle the respective switch below, to skip the procedure. If you don't know what this means, you most likely don't need to do anything and you can just continue.
fr: Si vous avez **déjà dévérouillé le bootloader** de l'appareil ou **déjà flashé un recovery**, sélectionnez les options ci-dessous pour sauter ces étapes. Si vous ne savez pas ce que cela veut dire, nous ne devez probablement pas cocher ces options et pouvez juste continuer.

source: Search for device
fr: Chercher l'appareil

source: Search for a connected device.
fr: Chercher un appareil connecté

source: No device detected! Connect to USB and try again.
fr: Aucun appareil détecté ! Connectez-le en USB et essayez à nouveau.

source: Device with code '{device_code}' is not supported yet.
fr: L'appareil '{device_code}' n'est pas encore supporté.

source: Request support for this device
fr: Demander le support pour cet appareil

source: your unlock code
fr: Votre code de dévérouillage

source: Unlock the bootloader
fr: Dévérouiller le bootloader

source: Open Link
fr: Ouvrir le lien

source: Command {command} failed! Try again or make sure everything is setup correctly.
fr: La commande {command} a échouée ! Essayez à nouveau et vérifiez que tout est configuré correctement.

source: Installation completed successfully!
fr: L'installation a réussi !

source: Now your devices boots into the new OS. Have fun with it!
fr: Votre appareil démarre maintenant sur le nouveau système. Amusez-vous bien !

source: If you liked the tool, help spread the word and **share it with people** who might want to use it. Also, you can consider contributing to make it better. There are a lot of different ways how you can help! [How to contribute]({contribute_link})
fr: Si vous avez aimé OpenAndroidInstaller, aidez-nous à le diffuser et **partagez-le** à des gens qui pourraient l'utiliser. Aussi, vous pouvez contribuer pour le rendre meilleur. Il y a de nombreuses façons d'aider ! [Comment contribuer]({contribute_link})

source: Let's start!
fr: C'est parti !

source: Welcome to the OpenAndroidInstaller!
fr: Bienvenue sur OpenAndroidInstaller !

source: Great that you want to install alternative, open source Android operating systems!
fr: C'est très bien que vous vouliez installer un système alternatif Android open source sur votre appareil !

source: We will walk you through the installation process nice and easy.
fr: Nous vous accompagnons tout au long du processus d'installation.

source: The following steps are performed in this tool: - First, we help you to **get your device ready** for the installation process. - Next, you can **select the operating system** you want to install (with guidance). - Then, we guide you though the process of **unlocking the bootloader** (if necessary). If you don't know what that means, it will be explained later. - As a next step, the **operation system is installed**. At this point you can also **select to install additional software** ("addons") like Google Apps. - Finally your device starts your new operating system.
fr: Les étapes suivantes sont effectées par cet outil : - Premièrement, nous vous aidons à **préparer votre appareil** pour l'installation. - Ensuite, vous pouvez **sélectionner le système** que vous voulez installer (avec de l'aide). - Puis, nous vous guidons pour le processus de **dévérouillage du bootloader** (si nécessaire). Si vous ne comprennez pas de quoi il s'agit, nous vous l'expliquerons plus tard. - Enfin, le **système d'exploitation est installé**. Vous pourrez également **installer des extensions** (addons) comme les Google Play Services. - Pour finir, votre appareil démarre sur le nouveau système.

source: Before you continue, make sure - your devices is on the latest system update. - you have a backup of all your important data, since this procedure will **erase all data from the phone**. - to not store the backup on the phone! Please note, that vendor specific back-ups will most likely not work on LineageOS!
fr: Avant de continuer, soyez sûr que : - votre appareil est sur la dernière mise à jour système. - vous avez une sauvegarde de toutes les données importantes, puisque la procédure va **supprimer toutes les données du téléphone**. - vous n'avez pas enregistré la sauvegarde sur votre téléphone ! Notez que les sauvegardes spécifiques au fabriquant ne vont très certainement pas fonctionner sur LineageOS.
