Repository: openandroidinstaller-dev/openandroidinstaller
Catalog: locales/*/LC_MESSAGES/*.po
Languages: fr

source: Boot custom recovery
fr: Démarrer le recovery

source: If you already flashed TWRP, boot into it by pressing 'Confirm and run'. Otherwise restart the process. Once your phone screen looks like the picture on the left, continue.
fr: Si vous avez déjà flashé TWRP, pressez 'Confirmer et exécuter' pour le lancerSinon, recommencez le processus. Une fois que l'écran du téléphone ressemble à l'image à gauche, continuez.

source: Frequently asked questions and encountered issues.
fr: Questions fréquemment posées et problèmes rencontrés

source: Give feedback
fr: Donnez votre avis

source: Give feedback about your experience with OpenAndroidInstaller
fr: Donnez votre avis à propos de votre expérience avec OpenAndroidInstaller

source: Report a bug
fr: Rapporter un problème

source: Report an issue on github
fr: Rapporter un problème sur GitHub

source: These instructions only work if you follow every section and step precisely. Do not continue after something fails!
fr: Ces instructions ne fonctionnent que si vous suivez précisément chaque étape. Ne continuez pas si quelque chose n'a pas marché !

source: I understand
fr: Je comprends

source: Current step: {title}
fr: Étape actuelle : {title}

source: Continue
fr: Continuer

source: Confirm and run
fr: Confirmer et exécuter

source: What kind of addons are supported?
fr: Quels types d'extensions sont supportés ?

source: ## Google Apps: There are different packages of Google Apps available. Most notable - [MindTheGapps](https://wiki.lineageos.org/gapps#downloads) and - [NikGApps](https://nikgapps.com). These packages are only dependent on your OS version and processor architecture, which can be found on each device specific info page. Filenames on MindTheGApps are of the format `MindTheGapps-<AndroidVersion>-<architecture>-<date>_<time>.zip` (with Android 12L being 12.1) and NikGApps are of the format `NikGapps-<flavour>-<architecture>-<AndroidVersion>-<date>-signed.zip`. NikGApps come in different flavours ranging from minimal Google support (core) to the full experience (full). ## MicroG The [MicroG](https://microg.org) project offers a free-as-in-freedom re-implementation of Google's proprietary Android user space apps and libraries. The recommended way to install MicroG is to use the zip file provided here: - [https://github.com/FriendlyNeighborhoodShane/MinMicroG_releases/releases](https://github.com/FriendlyNeighborhoodShane/MinMicroG_releases/releases). ## F-Droid Appstore F-Droid is an installable catalogue of libre software apps for Android. The F-Droid client app makes it easy to browse, install, and keep track of updates on your device. You can get the zip file to install this addon here: [https://f-droid.org/en/packages/org.fdroid.fdroid.privileged.ota](https://f-droid.org/en/packages/org.fdroid.fdroid.privileged.ota).
fr: ## Les applications Google : Il y a plusieurs paquets contenant les applications Google. Les principaux sont : - [MindTheGapps](https://wiki.lineageos.org/gapps#downloads) et - [NikGApps](https://nikgapps.com). Ces paquets sont seulement dépendants de votre système d'exploitation et de l'architecture du processeur, qui peut être trouvée dans les paramètres de l'appareil. Le nom des fichiers de MindTheGApps sont du type `MindTheGapps-<VersionAndroid>-<architecture>-<date>_<heure>.zip` (sachant que Android 12L est 12.1) et les fichiers NikGApps sont du type `NikGapps-<saveur>-<architecture>-<VersionAndroid>-<date>-signed.zip`. NikGApps est disponible avec différentes saveurs, allant d'un support minimal (core) à l'expérience complète (full). ## MicroG Le projet [MicroG](https://microg.org) offre une implémentation libre des librairies propriétaires de Google. La manière recommandée d'installer MicroG est d'utiliser le zip fourni ici : - [https://github.com/FriendlyNeighborhoodShane/MinMicroG_releases/releases](https://github.com/FriendlyNeighborhoodShane/MinMicroG_releases/releases). ## Magasin d'applications F-Droid F-Droid est un magasin d'applications libres pour Android. Le client F-Droid rend facile la recherche, installation et mise à jour des applications libres de votre appareil. Pour des mises à jour automatiques, vous pouvez installer ce fichier zip : [https://f-droid.org/fr/packages/org.fdroid.fdroid.privileged.ota](https://f-droid.org/fr/packages/org.fdroid.fdroid.privileged.ota).

source: Close
fr: Fermer

source: Selected addons:
fr: Extensions sélectionnées :

source: What kind of addons?
fr: Quel type d'extensions ?

source: Get more details on what addons are supported.
fr: Obtenir plus de détails sur les types d'extensions supportées.

source: You can select additional addons to install.
fr: Vous pouvez sélectionner des extensions supplémentaires à installer.

source: Here you can download the F-Droid App-Store:
fr: Vous pouvez télécharger le magasin d'application F-Droid ici :

source: Download F-Droid App-Store
fr: Télécharger le magasin d'applications F-Droid

source: Here you can find instructions on how to download the right Google apps for your device.
fr: Vous trouverez ici les instructions permettant de télécharger le bon paquet d'applications Google pour votre appareil.

source: Download Google Apps
fr: Télécharger les applications Google

source: Here you can download MicroG:
fr: Vous pouvez télécharger MicroG ici :

source: Download MicroG
fr: Télécharger MicroG

source: Select addons:
fr: Extensions sélectionnées :

source: Pick the addons you want to install
fr: Sélectionnez les extensions que vous voulez installer

source: No addons selected.
fr: Aucune extension sélectionnée.

source: Advanced output
fr: Journaux détaillés

source: Install Addons
fr: Installer des extensions

source: In the next steps, you flash the selected Addons. Confirm to install. This might take a while. At the end your phone will boot into the new OS.
fr: Dans les étapes suivantes, vous allez flasher les extensions sélectionnées. Confirmez pour installer. Cela peut prendre du temps. À la fin du processus, votre téléphone va démarrer sur le nouveau système.

source: Confirm and install addons
fr: Confirmer et installer les extensions

source: Do you want to skip?
fr: Voulez-vous ignorer ?

source: Skip
fr: Ignorer

source: Installing
fr: Installation

source: Installation failed! Try again or make sure everything is setup correctly.
fr: L'installation a échouée ! Essayez à nouveau ou soyez sûr que tout est paramétré correctement.

source: Install addons
fr: Installer les extensions

source: Install OS
fr: Installer le système

source: In the next steps, you finally flash the selected OS image. Connect your device with your computer with the USB-Cable. This step will format your phone and wipe all the data. It will also remove encryption and delete all files stored in the internal storage. Then the OS image will be installed. Confirm to install. This might take a while. At the end your phone will boot into the new OS. #### **Install addons:** If you want to install any addons like Google Apps, microG or F-droid, use the toggle below **before** starting the install process! After the installation you'll be taken through the process. Note, that this process is still somewhat experimental and using ROMs with included Google Apps (like PixelExperience) or microG (lineageOS for microG) is recommended. #### **Warning:** Don't try to add addons like Google Apps if your OS ROM already has Google Apps or microG included! Otherwise your system will break!
fr: Dans les étapes suivantes, vous allez enfin installer le système sélectionné. Connctez votre appareil à votre ordinateur avec un cable USB. Cette étape va formater votre téléphone et supprimer toutes vos données. Cela va également désactiver le chiffrement et supprimer tous les fichiers sauvegardés dans le stockage interne. Ensuite, le système va être installé. Confirmez pour installer. Cela peut prendre du temps. À la fin, votre téléphone va démarrer sur le nouveau système. #### **Installation des extensions :** Si vous voulez installer des extensions comme les Google Play Services, microG ou F-Droid, utilisez le bouton ci-dessous **avant** de commencer le processus d'installation ! Le processus d'installation des extensions a lieu après l'installation du système. Notez que ce processus est encore expérimental, et utiliser des ROM possèdant déjà les applications Google (comme PixelExperience) ou microG (comme lineageOS for microG) est recommandé. #### **Attention:** Ne tentez pas d'installer des extensions comme les applications Google si la ROM les contient déjà, ou microG ! Sinon, le système va casser !

source: Confirm and install
fr: Confirmer et installer

source: Please be patient, it may take a few minutes.
fr: Merci de patienter, cela peut prendre quelques minutes.

source: Back
fr: Retour

source: Where to find the current Android and/or firmware version?
fr: Où trouver la version d'Android actuelle et/ou la version du firmware ?

source: ## Find your current Android Version Scroll down on the Settings screen and look for an "About phone", "About tablet", or "System" option. You'll usually find this at the very bottom of the main Settings screen, under System, but depending on your phone it could be different. If you do find a specific option for System, you can usually find the "About Phone" underneath that. On the resulting screen, look for "Android version" to find the version of Android installed on your device. ## Find your current device firmware version On the same screen you find the "Android version" you can also find the Firmware Version. On some devices, the build version is basically the firmware version.
fr: ## Trouver votre version d'Android actuelle Allez dans les paramètres de votre téléphone et cherchez l'option"À propos" ou "Système". Vous trouvez généralement cette option tout en haut ou tout en bas, mais cela dépend des marques. Une fois que vous l'avez trouvé, cliquer dessus et cherchez la section "Version d'Android". ## Trouver la version du firmware actuel Sur la même page où vous avez trouvé la version d'Android, vous trouverez également la version du firmware / micrologiciel. Sur certain modèles, la version du firmware est la version de build / base.

source: How to Find the version
fr: Comment trouver la version

source: How to find the firmware and android version of your device.
fr: Comment trouver la version d'Android et di firmware de votre appareil.

source: Check the Requirements
fr: Vérifier les conditions

source: Before continuing you need to check some requirements to progress. Please read the instructions and check the boxes if everything is fine.
fr: Avant de continuer, vous devez vérifier quelques conditions. Merci de lire les instructions et cocher les cases si tout est bon.

source: The required android version is installed. (Or I know the risk of continuing)
fr: La version d'Android requise est installée. (Ou vous connaissez le risque encouru)

source: Android Version {required_android_version}:
fr: Version d'Android {required_android_version}

source: Before following these instructions please ensure that the device is currently using Android {required_android_version} firmware. If the vendor provided multiple updates for that version, e.g. security updates, make sure you are on the latest! If your current installation is newer or older than Android {required_android_version}, please upgrade or downgrade to the required version before proceeding (guides can be found on the internet!).
fr: Avant de suivre ces instructions, soyez sur que votre appareil est actuellement sous Android {required_android_version}. Si le fournisseur a proposé des mises à jour, soyez sur la plus récente ! Si votre installation est plus vieille ou plus récente que Android {required_android_version}, installez la version requise avant de continuer (des tutoriels peuvent être trouvés sur internet).

source: The required firmware version is installed. (Or I know the risk of continuing)
fr: La version du firmware requise est installée. (Ou vousconnaissez le risque encouru)

source: Firmware Version {required_firmware_version}:
fr: Firmware en version {required_firmware_version}

source: Before following these instructions please ensure that the device is on firmware version {required_firmware_version}. To discern this, you can run the command `adb shell getprop ro.build.display.id` on the stock ROM. If the device is not on the specified version, please follow the instructions below to install it.
fr: Avant de continuer ces instructions, soyez sûr que votre appareil a un firmware sous la version {required_firmware_version}. Pour être sûr, lancez la commande `adb shell getprop ro.build.display.id` sur votre téléphone sous le système du fabricant. Si l'appareil n'est pas sur la version spécifiée, merci de suivre les instructions ci-dessous pour l'installer.

source: The battery level is over 80%.
fr: Le niveau de batterie est supérieur à 80%.

source: #### Battery level over 80% Before continuing make sure your device battery level is above 80%.
fr: #### Niveau de batterie supérieur à 80% avant de continuer, soyez sûr que la batterie de l'appareil a un niveau supérieur à 80%.

source: Booted the stock OS at least once.
fr: Le système d'origine a été démarré au moins une fois.

source: #### Boot your device with the stock OS at least once and check every functionality. Make sure that you can send and receive SMS and place and receive calls (also via WiFi and LTE, if available), otherwise it won't work on your custom ROM either! Additionally, some devices require that VoLTE/VoWiFi be utilized once on stock to provision IMS.
fr: #### Démarrez votre appareil sur le système d'origine au moins une fois et vérifiez que toutes les fonctionnalités fonctionnent. Vérifiez que vous pouvez envoyer et recevoir des SMS et passer des appels (aussi en VoLTE et VoWiFi si disponible), sinon, cela ne fonctionnera pas non plus sur le nouveau système ! Aussi, certains appareils nécessitent que VoLTE/VoWiFi soient utilisés au moins une fois sur le système d'origine pour l'approvisionnement IMS.

source: No lock code or fingerprint lock enabled.
fr: Aucun code de déverouillage ou empreinte digitale activée

source: #### Disable all device lock codes and fingerprint locks.
fr: #### Désactiver tous les codes de dévérouillage et empreinte digitale.

source: What is an OS image and recovery and why do I need it?
fr: Qu'est-ce qu'une image système, un recovery et à quoi ça sert ?

source: ## OS image or ROM An operating system (OS) is system software that manages computer hardware, software resources, and provides common services for computer programs. Popular, custom operating systems for mobile devices based on Android are - [LineageOS](https://lineageos.org) - [/e/OS](https://e.foundation/e-os) or - [LineageOS for microG](https://lineage.microg.org) - and many others. Often, the related OS images are called 'ROM'. 'ROM' stands for *R*ead-*o*nly *m*emory, which is a type of non-volatile memory used in computers for storing software that is rarely changed during the life of the system, also known as firmware. ## Recovery Image A custom recovery is used for installing custom software on your device. This custom software can include smaller modifications like rooting your device or even replacing the firmware of the device with a completely custom ROM. OpenAndroidInstaller works with the [TWRP recovery project](https://twrp.me/about).
fr: ## Image système ou ROM Un système d'exploitation (OS en anglais) est un logiciel qui gère le matériel de l'appareil,les ressources, et fournis les logiciels de base. Parmi les ROM les plus populaires basées sur Android, citons - [LineageOS](https://lineageos.org) - [/e/OS](https://e.foundation/e-os) or - [LineageOS for microG](https://lineage.microg.org) - et bien d'autres. Souvent, les images système associées sont appelées 'ROM', pour *R*ead-*o*nly *m*emory, qui est un type de mémoire non volatile utilisée en informatique pour stocker les logiciels qui ne sont pas souvent changés durant la vie de l'appareil, aussi appelé firmware. ## Image recovery Un recovery personnalisé est utilisé pour installer des systèmes altrnatifs sur votre appareil. Ce logiciel permet de rooter l'appareil et remplacer le firmware avec un système complètement nouveau. OpenAndroidInstaller fonctionne avec le recovery [TWRP](https://twrp.me/about).

source: Selected image:
fr: Image sélectionnée :

source: Selected recovery:
fr: Recovery sélectionné :

source: Continue without additional images
fr: Continuer sans images additionnelles

source: What is this?
fr: Qu'est-ce que c'est ?

source: Get more details on custom operating system images and recoveries.
fr: Obtenir plus de détails sur les images système et les recoveries

source: Now pick an OS image and a recovery file:
fr: Sélectionnez maintenant une image système et un recovery :

source: Important notes for your device
fr: Notes importantes pour votre appreil

source: You can bring your own image and recovery or you download the officially supported image file for your device here:
fr: Vous pouvez utiliser votre propre image système et recovery, ou vous pouvez télécharger l'image officiellement supportée pour votre appareil ici :

source: Download LineageOS image
fr: Télécharger l'image de LineageOS

source: Download TWRP recovery
fr: Télécharger le recovery TWRP

source: Select an OS image:
fr: Sélectionnez une image système :

source: The image file should look something like `lineage-19.1-20221101-nightly-{device_code}-signed.zip`.
fr: Le nom de l'image doit ressembler à `lineage-19.1-20221101-nightly-{device_code}-signed.zip`.

source: Pick OS image
fr: Sélectionner l'image système

source: Select a TWRP recovery image:
fr: Sélectionner un recovery

source: The recovery image should look something like `twrp-3.7.0_12-0-{device_code}.img`. **Note:** This tool **only supports TWRP recoveries**.
fr: Le nom du recovery doit ressembler à `twrp-3.7.0_12-0-{device_code}.img`. **Note : ** OpenAndroidInstaller ne supporte **que le recovery TWRP**.

source: Pick TWRP recovery file
fr: Sélectionner le fichier de TWRP

source: - If something goes wrong, you can reinstall MiUI here: <https://xiaomifirmwareupdater.com/>
fr: - Si quelque chose se passe mal, vous pouvez réinstaller MiUI ici : <https://xiaomifirmwareupdater.com/>

source: - **This device has not been tested with OpenAndroidInstaller yet.** The installation can go wrong. You may have to finish the installation process with command line. If you test, please report the result on GitHub.
fr: - **Cet appareil n'a pas encore été testé avec OpenAndroidInstaller.** L'installation peut échouer, et vous devrez peut être terminer l'installation en lignes de commandes. Si vous testez, merci de le signaler sur GitHub.

source: Why do I need additional images and where do I get them?
fr: Pourquoi des images additionnelles et comment les obtenir ?

source: ## About additional images Some devices require additional images to be flashed before the recovery and OS image can be flashed. Not all images explained below are required for all devices. The installer will tell you which images are required for your device. ### dtbo.img The `dtbo.img` is a partition image that contains the device tree overlay. ### vbmeta.img The `vbmeta.img` is a partition image that contains the verified boot metadata. This is required to prevent issues with the verified boot process. ### super_empty.img The `super_empty.img` is used to wipe the super partition. This is required to prevent issues with the super partition when flashing a new ROM. ### vendor_boot.img The `vendor_boot.img` is a partition image that contains the vendor boot image. ## Where do I get these images? You can download the required images for your device from the [LineageOS downloads page](https://download.lineageos.org/devices/{device_code}/builds). If this download page does not contain the required images, you can try to find them on the [XDA developers forum](https://xdaforums.com).
fr: ## À propis des images additionnelles Certains appareils nécessitent des images additionnelles devant être flashées avant le recovery et le système. Elles ne sont pas toutes requises pour tous les appareils, l'installateur ne va demander que celles requises par votre appareil. ### dtbo.img La partition `dtbo.img` contient l'arborescence de l'appareil. ### vbmeta.img La partition `vbmeta.img` contient les métadonnées associées au dispositif verified boot. Cela est requis pour éviter les problèmes avec le dispositif verified boot. ### super_empty.img Le fichier `super_empty.img` est utilisé pour vider la partition `super`. Cela est nécessaire pour éviter les problèmes avec la partition `super` lors de l'installation d'un nouveau système. ### vendor_boot.img La partition `vendor_boot.img` contient l'image vendor boot. ## Où trouver ces images ? Vous pouvez trouver les images requises pour votre appareil sur le site de [LineageOS](https://download.lineageos.org/devices/{device_code}/builds). Si cette page ne les contient pas, cherchez sur le forum de développeurs [XDA developers forum](https://xdaforums.com).

source: Why do I need this and where do I get it?
fr: Pourquoi avoir besoin de cela et comment l'obtenir ?

source: Get more details on additional images and download links.
fr: Obtenir plus de détails sur les images additionnelles et les liens de téléchargement.

source: Select required additional images:
fr: Sélectionnez les images additionnelles requises :

source: Your selected device and ROM requires flashing of additional partitions. Please select the required images below. Make sure the file is for **your exact phone model!**
fr: Le système sélectionné requiert des partitions additionnelles. Merci de sélectionner les images ci-dessous. Soyez sûr que les fichiers sont pour **votre modèle exact !**

source: Pick `dtbo.img` image
fr: Sélectionner l'image `dtbo.img`

source: Pick `vbmeta.img` image
fr: Sélectionner l'image `vbmeta.img`

source: Pick `super_empty.img` image
fr: Sélectionner l'image `super_empty.img`

source: Pick `vendor_boot.img` image
fr: Sélectionner l'image `vendor_boot.img`

source: Image and/or recovery don't work with the device. Make sure you use a TWRP-based recovery.
fr: L'image système et/ou le recovery ne fonctionnent pas pour votre appareil. Soyez sûr que le recovery est basé sur TWRP.

source: Some additional images don't match or are missing. Please select the right ones.
fr: Au moins une image additionnelle ne correspond pas ou est manquante. Merci de sélectionner les bonnes.

source: Image doesn't work with the device.
fr: L'image ne correspond pas avec l'appareil.

source: How to enable developer options and OEM unlocking
fr: Comment activer les options développeur et le déverouillage OEM ?
